Revit 2027 API
FilterCategoryRule.AllCategoriesFilterable Method
 Checks that all of the given categories are filterable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool AllCategoriesFilterable(
	ICollection<ElementId> categories
)
Public Shared Function AllCategoriesFilterable (
	categories As ICollection(Of ElementId)
) As Boolean
public:
static bool AllCategoriesFilterable(
	ICollection<ElementId^>^ categories
)
static member AllCategoriesFilterable :
        categories : ICollection<ElementId> -> bool
Parameters
categories ICollection<ElementId>
 The set of categories to check.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilterCategoryRule Class
Autodesk.Revit.DB Namespace